# brew bundle --file ~/Brewfile
# Taps
tap "atombender/ktail"
#tap "chef/chef"
tap "derailed/k9s"
tap "homebrew/bundle"
# For installing multiple java versions https://medium.com/w-logs/installing-java-11-on-macos-with-homebrew-7f73c1e9fadf
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "int128/kubelogin"
# https://www.hashicorp.com/blog/announcing-hashicorp-homebrew-tap
tap "hashicorp/tap"
# https://github.com/puppetlabs/homebrew-puppet
tap "puppetlabs/puppet"
tap "int128/kubelogin"
tap "derailed/k9s"
tap "chef/chef"
tap "benwebber/tunnelblickctl"
# For dockle
tap "goodwithtech/r"
tap "mike-engel/jwt-cli"
# For Git -> Confluence Documentation
tap "kovetskiy/mark"

# Binaries
# A GitHub Action Runner for local development
brew "act"
# A Github Action validator
brew "action-validator"
# A Github Action linter
brew "actionlint"
brew "ansible"
brew "ansible-lint"
brew "asciiquarium"
# Tool version Manager used for Elixir http://asdf-vm.com/guide/introduction.html#how-it-works
# No longer supported (ie malware?)
# brew "asdf"
brew "awscli"
brew "aws-sam-cli"
brew "aws-vault"
brew "aws-cdk"
# Amazon AWS Shell
brew "aws-shell"
brew "bash"
brew "bash-completion@2"
# Best cat/more/less formatter
brew "bat"
brew "cmake"
# Cloud Formation Linter
brew "cfn-lint"
# CloudFlare SSL (ie openssl cli replacement)
brew "cfssl"
brew "cmatrix"
# Commitizen tui for conventional commits https://github.com/commitizen/cz-cli
# Probably prefer npm install -g commitizen because brew is very old 2.x vs 4.x
# git cz can be installed via npm install -g git-cz
#brew "commitizen"
brew "consul"
brew "consul-template"
# For things like realpath
brew "coreutils"
brew "curl"
#brew "elixir"
#brew "dnsmasq", restart_service: true
# A tool for exploring a docker image, layer contents, and discovering ways to shrink the size of your Docker/OCI image.
# https://github.com/wagoodman/dive
brew "dive"
# https://github.com/goodwithtech/dockle
# Contianer Image Linter
brew "dockle"
brew "go"
# Golang linter
brew "golangci-lint"
brew "gopls"
brew "docker-compose"
brew "docker-credential-helper"
# Practice your coding via exercism.io
brew "exercism"
brew "findutils"
brew "flake8"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-credential-manager"
brew "git-lfs"
brew "gnu-getopt"
# Similar to htop but more details
brew "glances"
# Graphical Ping
brew "gping"
brew "helm"
brew "helmfile"
brew "htop"
# JSON diff
brew "jd"
brew "jq"
# Artifactory CLI
brew "jfrog-cli"
# Interactive json cli too https://pauljuliusmartinez.github.io/?ref=console.dev
brew "jless"
# JSON Web Tokens CLI Decoder/Encoder
brew "jwt-cli"
brew "jsonlint"
# https://github.com/atombender/ktail
brew "ktail" 
brew "k9s" 
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
# See K8S resources in realtime 
brew "kubespy"
brew "kustomize"
# For heif-convert cli tool
brew "libheif"
brew "maven"
brew "make"
# For Git -> Confluence Documentation
brew "mark"
brew "minikube"
# A super power paging program https://www.jedsoft.org/most/
brew "most"
brew "mplayer"
brew "newsboat"
brew "npm"
brew "node"
# NodeJS Version Manager
brew "nvm"
# LLM Cli 
brew "ollama"
# https://github.com/vmware-tanzu/octant
# Shows how applications run on k8s
# Dead?
# brew "octant"
brew "pandoc"
brew "packer"
brew "pdf2svg"
# Python Package Manager
brew "poetry"
brew "python@3.11"
brew "pyenv-virtualenv"
brew "qemu"
# Remove PDF Passowrd
brew "qpdf"
# CLI tool for working with CloudFormation https://github.com/aws-cloudformation/rain
brew "rain"
brew "rename"
brew "rust"
# https://github.com/mozilla/sops manages secrets for helmfile
brew "sops"
brew "speedtest-cli"
brew "sqlite"
# For tunneling via SSH
brew "sshuttle"
# Great tool to simulate loads 
brew "stress"
brew "termshark"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
# https://github.com/kubeshop/tracetest?tab=readme-ov-file
brew "kubeshop/tracetest/tracetest"
brew "tree"
# License not opensource?
#brew "unrar"
brew "unnethack"
brew "wireshark"
brew "vim"
# Versatile HTTP load tester 
brew "vegeta"
brew "watch"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "1password-cli"
# Removes everything on uninstall of an app
cask "apptrap"
# Great USB Imager
cask "balenaetcher"
# Don't let the mac fall asleep (clickable)
cask "caffeine"
cask "chef/chef/inspec"
# Ebook Organizer
cask "calibre"
# Amazon Java JDK https://docs.aws.amazon.com/corretto/latest/corretto-11-ug/what-is-corretto-11.html
cask "corretto11"
cask "cyberduck"
# Database GUI
cask "dbeaver-community"
cask "discord"
# Not sure we really want this any more given that Docker wants a license for your desktop use
# Try Rancher Desktop for an alternative
# cask "docker"
cask "evernote"
cask "firefox"
# Best screen color changer (for day/night)
cask "flux"
# Excellent Git GUI
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
#cask "imagealpha"
#cask "imageoptim"
cask "inkscape"
cask "istat-menus"
cask "iterm2"
# Great copy and paste management tool
cask "jumpcut"
# The best encrypted chat
cask "keybase"
# K8S GUI https://github.com/lensapp/lens
cask "lens"
# Animated Screen Capture
cask "licecap"
cask "microsoft-teams"
# Like Charlesproxy but opensource https://mitmproxy.org
cask "mitmproxy"
# An opensource Redis Client GUI
cask "medis"
# Graphical Diff
# Probably want https://github.com/yousseb/meld instead?
cask "meld"
# Autodesk meshmixer used to separate polygons for multicolor MMU prints
#cask "meshmixer"
# Rename a list of files quickly
cask "namechanger"
# VPN Provider
#cask "mullvadvpn"
# Opensource Broadcast Software
cask "obs"
# The best Second Brain tool out there
cask "obsidian"
# https://github.com/puppetlabs/pdk
# Puppet Client Tools
#cask "pe-client-tools"
# Puppet Development Kit
#cask "pdk"
cask "plex"
# Music player for Plex
cask "plexamp"
# Podcatcher
cask "pocket-casts"
# Graphical REST Tool
cask "postman"
# GUI Postgres Client (like dbeaver but lighter)
cask "postico"
cask "powershell"
# SMS across devices
cask "pulse-sms"
# Rancher Desktop rancherdesktop.io is an alternative to Docker Desktop (and free)
cask "rancher"
# Replaced spectacle
cask "rectangle"
# Quickly prototype react apps
cask "react-proto"
# Secure Chat
cask "signal"
cask "slack"
cask "spotify"
cask "todoist"
cask "the-unarchiver"
cask "thunderbird"
#cask "transmission"
# VPN GUI for OpenVPN
#cask "tunnelblick"
#cask "tunnelblickctl"
cask "vagrant"
cask "virtualbox"
# Open source version of Visual Studio Code
#cask "vscodium"
cask "visual-studio-code"
cask "vlc"
# This includes the GUI
cask "wireshark"
cask "xscreensaver"
# OWASP Web App Scanner - Zed Attack Proxy
cask "zap"

# Need to write a commercial/closed source/optional Brewfile?
# Great Design tool
#cask "sketch"

# https://github.com/kylegordy/Brewfile/blob/master/Brewfile
